{
  "locations":
  {
    "location1":
    {
      "description":"Вы попадаете на мирную поляну, окруженную высокими вековыми деревьями. Воздух наполнен слабым, сладким ароматом. Невдалеке виднеются туманные пики гор. В центре поляны находится таинственное светящееся озеро.",
      "actions": {
        "Выпить из озера": "calm-grove",
        "Пойти вперед сквозь деревья": "forest",
        "Идти в горы":"mountains"
      }
    },
    "calm-grove":
    {
      "description": "Вы выпиваете воду и перед глазами все начинает кружиться.Вы теряете сознание, а когда просыпаетесь, то видите,что вы уже не на поляне, а в роще. Воздух здесь спокоен, а деревья мягко покачиваются в известном только им ритме. Путь разделяется на два направления.",
      "actions": {
        "Пойти налево":"church",
        "Пойти направо":"cave"
      }
    },
    "church":
    {
      "description":"Тропинка выводит вас на крохотную поляну.Там стоит древний храм, увитый виноградными лозами. Его поверхность украшают странные символы.Вы входите внутрь и видите два хрустальных шара: зеленый и красный.",
      "actions":
      {
        "Взять зеленый шар": "green_ball",
        "Взять красный шар": "red_ball"
      }
    },
    "green_ball":
    {
      "description":"Вы берете зеленый шар, и тут же прилетает стая волшебных птиц,и выносит вас из леса.",
      "actions":"win"
    },
    "red_ball":
    {
      "description":"Вы берете красный шар, и в тот же миг вас поглощает неистовый огненный вихрь .",
      "actions":"lose"
    },
    "cave":
    {
      "description":"Вы идете по тропинке,и видите темный вход, ведущий в таинственную пещеру. Изнутри доносятся странные звуки.",
      "actions":{
        "Войти в пещеру": "enter_cave",
        "Пойти дальше по тропинке":"go_ahead"
      }
    },
    "enter_cave":
    {
      "description":"Вы входите в пещеру. Звуки становятся громче. Вдруг на вас набрасывается стая летучих мышей. Они отрывают вас от земли и уносят во тьму.",
      "actions":"lose"
    },
    "go_ahead":
    {
      "description":"Вы идете дальше по тропинке. Вдруг деревья расступаются и вы выходите из леса на открытую местность, залитую ярким солнцем.",
      "actions":"win"
    },
    "forest":
    {
      "description":"Вы идете идете вперед сквозь деревья. Лес становится все гуще и темнее. Кругом мертвая тишина.Вдруг вы видите странных летающих существ,похожих на фей.",
      "actions":
      {
        "Попросить помощь у фей": "river",
        "Залезть на дерево": "top_tree"
      }

    },
    "river":
    {
      "description":"Вы проситите помощи у странных существ. Они указывают вам на едва заметную узкую тропинку. Вы идете по ней и вскоре видите бурную реку. Через неё переброшен ненадежный на вид мостик.",
      "actions":
      {
        "Перейти по мосту": "bridge",
        "Переплыть реку": "swim"
      }
    },
    "bridge":
    {
      "description":"Вы проходите по мосту.Он сильно раскачивается, но вам все же удается попасть на другой берег. Тут вы видите выход из леса.",
      "actions":"win"
    },
    "swim":
    {
      "description":"Вы начинаете плыть,но течение оказывается слишком сильным. Не справившись, вы погружаетесь на дно.",
      "actions":"lose"
    },
    "top_tree":
    {
      "description":"Вы залезаете на верхушку высокого дерева. Оттуда открывается панорамный вид на весь лес. Вы видите дорогу, ведущую из леса. Спустившись, вы идете по ней и благополучно выбираетесь из леса.",
      "actions":"win"
    },
    "mountains": {
      "description": "Воздух становится разреженным, когда вы поднимаетесь на туманные вершины, а вид внизу закрывает клубящийся туман. Подниматься становится все тяжелее, вы очень устали.",
      "actions":
      {
        "Продолжить подъем": "devils",
        "Спуститься вниз": "swamp"
      }
    },
    "devils": {
      "description": "Вы продолжаете взбираться. Наконец, вы добираетесь до вершины горы. Там вокруг костра сидят черные создания с острыми ушами, длинными когтями и хвостами. Они требуют у вас плату. У вас есть фантик от конфеты и золотые часы на руке.",
      "actions":
      {
        "Отдать часы":"watch",
        "Отдать фантик":"sweet"
      }
    },
    "watch": {
      "description": "Вы отдаете им часы. Они благодарят вас и показывают путь из леса",
      "actions": "win"
    },
    "sweet": {
      "description": "Вы отдаете им фантик. Они приходят в ярость, набрасываются на вас и съедают.",
      "actions": "lose"
    },
    "swamp": {
      "description": "Вы начинаете спускаться вниз, но из-за тумана не видите куда идете. Почва под вашими ногами становится зыбкой.Вы понимаете,что попали на болото. Вокруг вас влажная местность с искривленными деревьями, поднимающимися из мутной воды. Вдалеке мерцают странные огни,они как будто показывают путь.",
      "actions":
      {
        "Пойти вслед за огнями": "light",
        "Попытаться выбраться самому": "yourself"
      }
    },
    "light": {
      "description": "Вы идете за огоньками, и они благополучно выводят вас из леса.",
      "actions": "win"
    },
    "yourself": {
      "description": "Вы пытаетесь самостоятельно найти дорогу, но вдруг вы проваливаетесь в болото и вас затягивает в трясину.",
      "actions": "lose"
    }
  }
}